RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_tmr6.h
/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup TMR6_Global_Macros TMR6 Global Macros
 * @{
 */


/** @defgroup TMR6_Sta_Bit_Get_Define TMR6 status bit define
 * @{
 */
/* Status bit indicate that GCMAR register matched with counter register */
#define TMR6_STAT_CNT_MATCH_A          (TMR6_STFLR_CMAF)
/* Status bit indicate that GCMBR register matched with counter register */
#define TMR6_STAT_CNT_MATCH_B          (TMR6_STFLR_CMBF)
/* Status bit indicate that GCMCR register matched with counter register */
#define TMR6_STAT_CNT_MATCH_C          (TMR6_STFLR_CMCF)
/* Status bit indicate that GCMDR register matched with counter register */
#define TMR6_STAT_CNT_MATCH_D          (TMR6_STFLR_CMDF)
/* Status bit indicate that GCMER register matched with counter register */
#define TMR6_STAT_CNT_MATCH_E          (TMR6_STFLR_CMEF)
/* Status bit indicate that GCMFR register matched with counter register */
#define TMR6_STAT_CNT_MATCH_F          (TMR6_STFLR_CMFF)
/* Status bit indicate that counter register overflow */
#define TMR6_STAT_OVERFLOW             (TMR6_STFLR_OVFF)
/* Status bit indicate that counter register underflow */
#define TMR6_STAT_UNDERFLOW            (TMR6_STFLR_UDFF)
/* Status bit indicate that dead time error */
#define TMR6_STAT_DEAD_TIME_ERR        (TMR6_STFLR_DTEF)
/* Status bit indicate that SCMAR register matched with counter register during count-up */
#define TMR6_STAT_UPCNT_SP_MATCH_A     (TMR6_STFLR_CMSAUF)
/* Status bit indicate that SCMAR register matched with counter register during count-down */
#define TMR6_STAT_DOWNCNT_SP_MATCH_A   (TMR6_STFLR_CMSADF)
/* Status bit indicate that SCMBR register matched with counter register during count-up */
#define TMR6_STAT_UPCNT_SP_MATCH_B     (TMR6_STFLR_CMSBUF)
/* Status bit indicate that SCMBR register matched with counter register during count-down */
#define TMR6_STAT_DOWNCNT_SP_MATCH_B   (TMR6_STFLR_CMSBDF)
/* Counter direction flag */
#define TMR6_STAT_CNT_DIR              (TMR6_STFLR_DIRF)
/**
 * @}
 */

/** @defgroup TMR6_Interrupt_Enable_Bit_Define TMR6 interrupt configuration bit define
 * @{
 */
/* Interrupt enable bit for GCMAR register matched */
#define TMR6_IRQ_EN_CNT_MATCH_A           (TMR6_ICONR_INTENA)
/* Interrupt enable bit for GCMBR register matched */
#define TMR6_IRQ_EN_CNT_MATCH_B           (TMR6_ICONR_INTENB)
/* Interrupt enable bit for GCMCR register matched */
#define TMR6_IRQ_EN_CNT_MATCH_C           (TMR6_ICONR_INTENC)
/* Interrupt enable bit for GCMDR register matched */
#define TMR6_IRQ_EN_CNT_MATCH_D           (TMR6_ICONR_INTEND)
/* Interrupt enable bit for GCMER register matched */
#define TMR6_IRQ_EN_CNT_MATCH_E           (TMR6_ICONR_INTENE)
/* Interrupt enable bit for GCMFR register matched */
#define TMR6_IRQ_EN_CNT_MATCH_F           (TMR6_ICONR_INTENF)
/* Interrupt enable bit for counter register overflow */
#define TMR6_IRQ_EN_OVERFLOW              (TMR6_ICONR_INTENOVF)
/* Interrupt enable bit for counter register underflow */
#define TMR6_IRQ_EN_UNDERFLOW             (TMR6_ICONR_INTENUDF)
/* Interrupt enable bit for dead time */
#define TMR6_IRQ_EN_DEAD_TIME_ERR         (TMR6_ICONR_INTENDTE)
/* Interrupt enable bit for SCMAR register matched during count-up*/
#define TMR6_IRQ_EN_UPCNT_SP_MATCH_A      (TMR6_ICONR_INTENSAU)
/* Interrupt enable bit for SCMAR register matched during count-down*/
#define TMR6_IRQ_EN_DOWNCNT_SP_MATCH_A    (TMR6_ICONR_INTENSAD)
/* Interrupt enable bit for SCMBR register matched during count-up*/
#define TMR6_IRQ_EN_UPCNT_SP_MATCH_B      (TMR6_ICONR_INTENSBU)
/* Interrupt enable bit for SCMBR register matched during count-down*/
#define TMR6_IRQ_EN_DOWNCNT_SP_MATCH_B    (TMR6_ICONR_INTENSBD)
/**
 * @}
 */

/** @defgroup TMR6_Period_Register_Index_Define TMR6 period register Index define
 * @{
 */
#define TMR6_PERIOD_REG_A   (0x00UL)
#define TMR6_PERIOD_REG_B   (0x01UL)
#define TMR6_PERIOD_REG_C   (0x02UL)
/**
 * @}
 */

/** @defgroup TMR6_Compare_Register_Index_Define TMR6 compare register Index define
 * @{
 */
#define TMR6_CMP_REG_A      (0x00UL)
#define TMR6_CMP_REG_B      (0x01UL)
#define TMR6_CMP_REG_C      (0x02UL)
#define TMR6_CMP_REG_D      (0x03UL)
#define TMR6_CMP_REG_E      (0x04UL)
#define TMR6_CMP_REG_F      (0x05UL)
/**
 * @}
 */

/** @defgroup TMR6_Compare_channel_Define TMR6 general/special compare channel index define
 * @{
 */
#define TMR6_CH_A           (0x00UL)
#define TMR6_CH_B           (0x01UL)
/**
 * @}
 */

/** @defgroup TMR6_Buffer_Function_sta_Define TMR6 buffer function status define
 * @{
 */
#define TMR6_BUF_FUNC_OFF   (0x00000000UL)
#define TMR6_BUF_FUNC_ON    (TMR6_BCONR_BENA)
/**
 * @}
 */

/** @defgroup TMR6_Buffer_Number_Chose_Define TMR6 buffer number configuration define
 * @{
 */
#define TMR6_BUF_FUNC_SINGLE   (0x00000000UL)
#define TMR6_BUF_FUNC_DOUBLE   (TMR6_BCONR_BSEA)
/**
 * @}
 */

/** @defgroup TMR6_Buffer_Transfer_Time_Cfg_Define TMR6 buffer transfer time configuration define
 * @{
 */
#define TMR6_BUF_TRANS_TIM_NONE        (0x00000000UL)
#define TMR6_BUF_TRANS_TIM_OVERFLOW    (TMR6_BCONR_BTRUA)
#define TMR6_BUF_TRANS_TIM_UNDERFLOW   (TMR6_BCONR_BTRDA)
#define TMR6_BUF_TRANS_TIM_BOTH        (TMR6_BCONR_BTRUA | TMR6_BCONR_BTRDA)
/**
 * @}
 */

/** @defgroup TMR6_Valid_Period_Count_Condition_Define TMR6 valid period function count condition define
 * @{
 */
/* Valid period function off */
#define TMR6_VALID_PERIOD_FUNC_OFF             (0x00000000UL)
/* Counted when Sawtooth waveform overflow and underflow, triangular wave underflow */
#define TMR6_VALID_PERIOD_CNT_COND_UNDERFLOW   (TMR6_VPERR_PCNTE_0)
/* Counted when Sawtooth waveform overflow and underflow, triangular wave overflow */
#define TMR6_VALID_PERIOD_CNT_COND_OVERFLOW    (TMR6_VPERR_PCNTE_1)
/* Counted when Sawtooth waveform overflow and underflow, triangular wave overflow and underflow */
#define TMR6_VALID_PERIOD_CNT_COND_BOTH        (TMR6_VPERR_PCNTE_0 | TMR6_VPERR_PCNTE_1)
/**
 * @}
 */

/** @defgroup TMR6_Valid_Period_Count_Define TMR6 valid period function count define
 * @{
 */
/* Valid period count function invalid */
#define TMR6_VALID_PERIOD_CNT_INVALID          (0x00000000UL)
/* Interrupt and event valid every other 1 period */
#define TMR6_VALID_PERIOD_CNT_1                (TMR6_VPERR_PCNTS_0)
/* Interrupt and event valid every other 2 period */
#define TMR6_VALID_PERIOD_CNT_2                (TMR6_VPERR_PCNTS_1)
/* Interrupt and event valid every other 3 period */
#define TMR6_VALID_PERIOD_CNT_3                (TMR6_VPERR_PCNTS_0 | TMR6_VPERR_PCNTS_1)
/* Interrupt and event valid every other 4 period */
#define TMR6_VALID_PERIOD_CNT_4                (TMR6_VPERR_PCNTS_2)
/* Interrupt and event valid every other 5 period */
#define TMR6_VALID_PERIOD_CNT_5                (TMR6_VPERR_PCNTS_2 | TMR6_VPERR_PCNTS_0)
/* Interrupt and event valid every other 6 period */
#define TMR6_VALID_PERIOD_CNT_6                (TMR6_VPERR_PCNTS_2 | TMR6_VPERR_PCNTS_1)
/* Interrupt and event valid every other 7 period */
#define TMR6_VALID_PERIOD_CNT_7                (TMR6_VPERR_PCNTS_2 | TMR6_VPERR_PCNTS_1 | TMR6_VPERR_PCNTS_0)
/**
 * @}
 */

/** @defgroup TMR6_Valid_Period_CHA_STAT_Define TMR6 valid period function channel A status define
 * @{
 */
#define TMR6_VALID_PERIOD_FUNC_CHA_OFF         (0x00000000UL)
#define TMR6_VALID_PERIOD_FUNC_CHA_ON          (TMR6_VPERR_SPPERIA)
/**
 * @}
 */

