RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/inc/hc32f4a0_tmr6.h
/** @defgroup TMR6_Valid_Period_CHB_STAT_Define TMR6 valid period function channel B status define
 * @{
 */
#define TMR6_VALID_PERIOD_FUNC_CHB_OFF         (0x00000000UL)
#define TMR6_VALID_PERIOD_FUNC_CHB_ON          (TMR6_VPERR_SPPERIB)
/**
 * @}
 */

/** @defgroup TMR6_DeadTime_Reg_Define TMR6 dead time register define
 * @{
 */
/* Register DTUAR */
#define TMR6_DEADTIME_REG_UP_A                 (0x00U)
/* Register DTDAR */
#define TMR6_DEADTIME_REG_DOWN_A               (0x01U)
/* Register DTUBR */
#define TMR6_DEADTIME_REG_UP_B                 (0x02U)
/* Register DTDBR */
#define TMR6_DEADTIME_REG_DOWN_B               (0x03U)
/**
 * @}
 */

/** @defgroup TMR6_Port_Define TMR6 input and output port define
 * @{
 */
/* port TIM6_<t>_PWMA */
#define TMR6_IO_PWMA                            (0x00U)
/* port TIM6_<t>_PWMB */
#define TMR6_IO_PWMB                            (0x01U)
/* Input port TIM6_TRIGA */
#define TMR6_INPUT_TRIGA                        (0x02U)
/* Input port TIM6_TRIGB */
#define TMR6_INPUT_TRIGB                        (0x03U)
/* Input port TIM6_TRIGC */
#define TMR6_INPUT_TRIGC                        (0x04U)
/* Input port TIM6_TRIGD */
#define TMR6_INPUT_TRIGD                        (0x05U)
/**
 * @}
 */

/** @defgroup TMR6_Input_Port_Filter_Clk TMR6 input port define
 * @{
 */
#define TMR6_INPUT_FILTER_PCLK0_DIV1            (0x00U)
#define TMR6_INPUT_FILTER_PCLK0_DIV4            (0x01U)
#define TMR6_INPUT_FILTER_PCLK0_DIV16           (0x02U)
#define TMR6_INPUT_FILTER_PCLK0_DIV64           (0x03U)
/**
 * @}
 */

/** @defgroup TMR6_Port_Mode_Func TMR6 port function mode selection
 * @{
 */
#define TMR6_PORT_COMPARE_OUTPUT                 (0x00U)
#define TMR6_PORT_CAPTURE_INPUT                  (TMR6_PCNAR_CAPMDA)
/**
 * @}
 */

/** @defgroup TMR6_Port_Input_Filter_Sta TMR6 port input filter function status
 * @{
 */
#define TMR6_PORT_INPUT_FILTER_OFF               (0x00U)
#define TMR6_PORT_INPUT_FILTER_ON                (0x01U)
/**
 * @}
 */

/** @defgroup TMR6_Port_Output_Sta TMR6 port output status
 * @{
 */
#define TMR6_PORT_OUTPUT_STA_LOW                 (0x00U)
#define TMR6_PORT_OUTPUT_STA_HIGH                (0x01U)
#define TMR6_PORT_OUTPUT_STA_HOLD                (0x02U)
#define TMR6_PORT_OUTPUT_STA_REVERSE             (0x03U)
/**
 * @}
 */

/** @defgroup TMR6_Force_Port_Output_Sta TMR6 force port output status next period
 * @{
 */
#define TMR6_FORCE_PORT_OUTPUT_INVALID          (0x00U)
#define TMR6_FORCE_PORT_OUTPUT_STA_LOW          (0x02U)
#define TMR6_FORCE_PORT_OUTPUT_STA_HIGH         (0x03U)
/**
 * @}
 */

/** @defgroup TMR6_Emb_channel TMR6 EMB event valid channel
 * @{
 */
#define TMR6_EMB_EVENT_VALID_CH0            (0x00U)
#define TMR6_EMB_EVENT_VALID_CH1            (TMR6_PCNAR_EMBSA_0)
#define TMR6_EMB_EVENT_VALID_CH2            (TMR6_PCNAR_EMBSA_1)
#define TMR6_EMB_EVENT_VALID_CH3            (TMR6_PCNAR_EMBSA_0 | TMR6_PCNAR_EMBSA_1)
/**
 * @}
 */

/** @defgroup TMR6_Emb_Release_Mode TMR6 EMB function release mode when EMB event invalid
 * @{
 */
#define TMR6_EMB_RELEASE_IMMEDIATE           (0x00U)
#define TMR6_EMB_RELEASE_OVERFLOW            (TMR6_PCNAR_EMBRA_0)
#define TMR6_EMB_RELEASE_UNDERFLOW           (TMR6_PCNAR_EMBRA_1)
#define TMR6_EMB_RELEASE_OVERFLOW_UNDERFLOW  (TMR6_PCNAR_EMBRA_0 | TMR6_PCNAR_EMBRA_1)
/**
 * @}
 */

/** @defgroup TMR6_Emb_Port_Sta TMR6 EMB port output status when EMB event valid
 * @{
 */
#define TMR6_EMB_PORTSTA_NORMAL              (0x00U)
#define TMR6_EMB_PORTSTA_HIZ                 (TMR6_PCNAR_EMBCA_0)
#define TMR6_EMB_PORTSTA_LOW                 (TMR6_PCNAR_EMBCA_1)
#define TMR6_EMB_PORTSTA_HIGH                (TMR6_PCNAR_EMBCA_0 | TMR6_PCNAR_EMBCA_1)
/**
 * @}
 */

/** @defgroup TMR6_Deadtime_CountUp_Buf_Func_define TMR6 Dead time buffer function for count up stage
 * @{
 */
#define TMR6_DEADTIME_CNT_UP_BUF_OFF              (0x00U)
#define TMR6_DEADTIME_CNT_UP_BUF_ON               (TMR6_DCONR_DTBENU)
/**
 * @}
 */

/** @defgroup TMR6_Deadtime_CountDown_Buf_Func_define TMR6 Dead time buffer function for count down stage
 * @{
 */
#define TMR6_DEADTIME_CNT_DOWN_BUF_OFF              (0x00U)
#define TMR6_DEADTIME_CNT_DOWN_BUF_ON               (TMR6_DCONR_DTBEND)
/**
 * @}
 */

/** @defgroup TMR6_Deadtime_Buf_Transfer_Condition_define TMR6 Dead time buffer transfer condition define for triangular count mode
 * @{
 */
#define TMR6_DEADTIME_TRANS_COND_NONE                (0x00U)
#define TMR6_DEADTIME_TRANS_COND_OVERFLOW            (TMR6_DCONR_DTBTRU)
#define TMR6_DEADTIME_TRANS_COND_UNDERFLOW           (TMR6_DCONR_DTBTRD)
#define TMR6_DEADTIME_TRANS_COND_BOTH                (TMR6_DCONR_DTBTRU | TMR6_DCONR_DTBTRD)
/**
 * @}
 */

/** @defgroup TMR6_Deadtime_Reg_Equal_Func_define TMR6 Dead time function DTDAR equal DTUAR
 * @{
 */
#define TMR6_DEADTIME_EQUAL_OFF                     (0x00U)
#define TMR6_DEADTIME_EQUAL_ON                      (TMR6_DCONR_SEPA)
/**
 * @}
 */

/** @defgroup TMR6_Soft_Sync_Ctrl_Unit_Number_define TMR6 Software synchronization start/stop/clear/update unit number define
 * @{
 */
#define TMR6_SOFT_SYNC_CTRL_U1              (TMR6_SSTAR_SSTA1)
#define TMR6_SOFT_SYNC_CTRL_U2              (TMR6_SSTAR_SSTA2)
#define TMR6_SOFT_SYNC_CTRL_U3              (TMR6_SSTAR_SSTA3)
#define TMR6_SOFT_SYNC_CTRL_U4              (TMR6_SSTAR_SSTA4)
#define TMR6_SOFT_SYNC_CTRL_U5              (TMR6_SSTAR_SSTA5)
#define TMR6_SOFT_SYNC_CTRL_U6              (TMR6_SSTAR_SSTA6)
#define TMR6_SOFT_SYNC_CTRL_U7              (TMR6_SSTAR_SSTA7)
#define TMR6_SOFT_SYNC_CTRL_U8              (TMR6_SSTAR_SSTA8)
/**
 * @}
 */

/** @defgroup TMR6_hardware_control_event_define TMR6 hardware start/stop/clear/update/capture events define
 * @{
 */
#define TMR6_HW_CTRL_PWMA_RISING             (TMR6_HSTAR_HSTA0)
#define TMR6_HW_CTRL_PWMA_FAILLING           (TMR6_HSTAR_HSTA1)
#define TMR6_HW_CTRL_PWMB_RISING             (TMR6_HSTAR_HSTA2)
#define TMR6_HW_CTRL_PWMB_FAILLING           (TMR6_HSTAR_HSTA3)
#define TMR6_HW_CTRL_INTER_EVENT0            (TMR6_HSTAR_HSTA8)
#define TMR6_HW_CTRL_INTER_EVENT1            (TMR6_HSTAR_HSTA9)
#define TMR6_HW_CTRL_INTER_EVENT2            (TMR6_HSTAR_HSTA10)
#define TMR6_HW_CTRL_INTER_EVENT3            (TMR6_HSTAR_HSTA11)
#define TMR6_HW_CTRL_TRIGEA_RISING           (TMR6_HSTAR_HSTA16)
#define TMR6_HW_CTRL_TRIGEA_FAILLING         (TMR6_HSTAR_HSTA17)
#define TMR6_HW_CTRL_TRIGEB_RISING           (TMR6_HSTAR_HSTA18)
#define TMR6_HW_CTRL_TRIGEB_FAILLING         (TMR6_HSTAR_HSTA19)
#define TMR6_HW_CTRL_TRIGEC_RISING           (TMR6_HSTAR_HSTA20)
#define TMR6_HW_CTRL_TRIGEC_FAILLING         (TMR6_HSTAR_HSTA21)
#define TMR6_HW_CTRL_TRIGED_RISING           (TMR6_HSTAR_HSTA22)
#define TMR6_HW_CTRL_TRIGED_FAILLING         (TMR6_HSTAR_HSTA23)
/**
 * @}
 */

/** @defgroup TMR6_hardware_count_event_define TMR6 hardware increase/decrease events define
 * @{
 */
#define TMR6_HW_CNT_PWMAL_PWMBRISING        (TMR6_HCUPR_HCUP0)
#define TMR6_HW_CNT_PWMAL_PWMBFAILLING      (TMR6_HCUPR_HCUP1)
#define TMR6_HW_CNT_PWMAH_PWMBRISING        (TMR6_HCUPR_HCUP2)
#define TMR6_HW_CNT_PWMAH_PWMBFAILLING      (TMR6_HCUPR_HCUP3)
#define TMR6_HW_CNT_PWMBL_PWMARISING        (TMR6_HCUPR_HCUP4)
#define TMR6_HW_CNT_PWMBL_PWMAFAILLING      (TMR6_HCUPR_HCUP5)
#define TMR6_HW_CNT_PWMBH_PWMARISING        (TMR6_HCUPR_HCUP6)
#define TMR6_HW_CNT_PWMBH_PWMAFAILLING      (TMR6_HCUPR_HCUP7)
#define TMR6_HW_CNT_INTER_EVENT0            (TMR6_HCUPR_HCUP8)
#define TMR6_HW_CNT_INTER_EVENT1            (TMR6_HCUPR_HCUP9)
#define TMR6_HW_CNT_INTER_EVENT2            (TMR6_HCUPR_HCUP10)
#define TMR6_HW_CNT_INTER_EVENT3            (TMR6_HCUPR_HCUP11)
#define TMR6_HW_CNT_TRIGEA_RISING           (TMR6_HCUPR_HCUP16)
#define TMR6_HW_CNT_TRIGEA_FAILLING         (TMR6_HCUPR_HCUP17)
#define TMR6_HW_CNT_TRIGEB_RISING           (TMR6_HCUPR_HCUP18)
#define TMR6_HW_CNT_TRIGEB_FAILLING         (TMR6_HCUPR_HCUP19)
#define TMR6_HW_CNT_TRIGEC_RISING           (TMR6_HCUPR_HCUP20)
#define TMR6_HW_CNT_TRIGEC_FAILLING         (TMR6_HCUPR_HCUP21)
#define TMR6_HW_CNT_TRIGED_RISING           (TMR6_HCUPR_HCUP22)
#define TMR6_HW_CNT_TRIGED_FAILLING         (TMR6_HCUPR_HCUP23)
/**
 * @}
 */

/** @defgroup TMR6_Count_Direction_define TMR6 base counter function direction define
 * @{
 */
#define TMR6_CNT_INCREASE                   (TMR6_GCONR_DIR)
#define TMR6_CNT_DECREASE                   (0x00U)
/**
 * @}
 */

/** @defgroup TMR6_Count_Mode_define TMR6 base counter function mode define
 * @{
 */
#define TMR6_MODE_SAWTOOTH                   (0x00U)
#define TMR6_MODE_TRIANGLE                   (TMR6_GCONR_MODE)
/**
 * @}
 */

/** @defgroup TMR6_Count_Clock_define TMR6 base counter clock source define
 * @{
 */
#define TMR6_CLK_PCLK0_DIV1                  (0x00UL)
#define TMR6_CLK_PCLK0_DIV2                  (0x01UL << TMR6_GCONR_CKDIV_POS)
#define TMR6_CLK_PCLK0_DIV4                  (0x02UL << TMR6_GCONR_CKDIV_POS)
#define TMR6_CLK_PCLK0_DIV8                  (0x03UL << TMR6_GCONR_CKDIV_POS)
#define TMR6_CLK_PCLK0_DIV16                 (0x04UL << TMR6_GCONR_CKDIV_POS)
#define TMR6_CLK_PCLK0_DIV32                 (0x05UL << TMR6_GCONR_CKDIV_POS)
#define TMR6_CLK_PCLK0_DIV64                 (0x06UL << TMR6_GCONR_CKDIV_POS)
#define TMR6_CLK_PCLK0_DIV128                (0x07UL << TMR6_GCONR_CKDIV_POS)
#define TMR6_CLK_PCLK0_DIV256                (0x08UL << TMR6_GCONR_CKDIV_POS)
#define TMR6_CLK_PCLK0_DIV512                (0x09UL << TMR6_GCONR_CKDIV_POS)
#define TMR6_CLK_PCLK0_DIV1024               (0x0AUL << TMR6_GCONR_CKDIV_POS)
/**
 * @}
 */

/** @defgroup TMR6_Count_Stop_After_Overflow_define TMR6 count stop after overflow function define
 * @{
 */
#define TMR6_CNT_CONTINUOUS                   (0x00U)
#define TMR6_STOP_AFTER_OVF                   (TMR6_GCONR_OVSTP)
/**
 * @}
 */

/** @defgroup TMR6_Zmask_Cycle_define TMR6 Z Mask input function mask cycles number define
 * @{
 */
#define TMR6_ZMASK_CYCLE_FUNC_INVALID         (0x00U)
#define TMR6_ZMASK_CYCLE_4                    (TMR6_GCONR_ZMSKVAL_0)
#define TMR6_ZMASK_CYCLE_8                    (TMR6_GCONR_ZMSKVAL_1)
#define TMR6_ZMASK_CYCLE_16                   (TMR6_GCONR_ZMSKVAL_0 | TMR6_GCONR_ZMSKVAL_1)
/**
 * @}
 */

/** @defgroup TMR6_Zmask_Position_Unit_Clear_Func_define TMR6 unit as position timer, z phase input mask function define for clear action
 * @{
 */
#define TMR6_POS_CLR_ZMASK_FUNC_INVALID       (0x00U)
#define TMR6_POS_CLR_ZMASK_FUNC_VALID         (TMR6_GCONR_ZMSKPOS)
/**
 * @}
 */

